INSERT INTO lease_contract (lessee, valid_until, contract_date, tenant)
VALUES
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Иванов Иван Иванович')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Петрова Анна Сергеевна')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Сидоров Алексей Викторович')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Козлова Мария Дмитриевна')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Михайлова Екатерина Валентиновна')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Новиков Дмитрий Викторович')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Лебедев Артем Павлович')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Шевченко Ирина Александровна')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Попова Ольга Викторовна')),
('Иванов Иван Иванович', '2025-01-01', '2023-01-01', (SELECT fio FROM resident WHERE fio = 'Романова Татьяна Вячеславовна'));

UPDATE resident
SET status = 'SETTLED'
WHERE fio IN (
    'Иванов Иван Иванович',
    'Петрова Анна Сергеевна',
    'Сидоров Алексей Викторович',
    'Козлова Мария Дмитриевна',
    'Михайлова Екатерина Валентиновна',
    'Новиков Дмитрий Викторович',
    'Лебедев Артем Павлович',
    'Шевченко Ирина Александровна',
    'Попова Ольга Викторовна',
    'Романова Татьяна Вячеславовна'
);